research/visualization_methods/outputs/Robotic Arm__robotic_arm_3d_model/robotic_arm_3d_model.dot
digraph G {
  "I" [label="I"];
  "MvNormal" [label="MvNormal"];
  "arm" [label="arm"];
  "covariance" [label="covariance"];
  "dt" [label="dt"];
  "environment" [label="environment"];
  "g" [label="g"];
  "get_gravity" [label="get_gravity"];
  "get_properties" [label="get_properties"];
  "goal" [label="goal"];
  "gravity_compensation" [label="gravity_compensation"];
  "i" [label="i"];
  "initial_state" [label="initial_state"];
  "mean" [label="mean"];
  "num_links, _, link_masses, _" [label="num_links, _, link_masses, _"];
  "s" [label="s"];
  "state_transition_3d" [label="state_transition_3d"];
  "u" [label="u"];
  "zeros" [label="zeros"];
  "Σ" [label="Σ"];
  "μ" [label="μ"];
  "I" -> "s";
  "MvNormal" -> "s";
  "MvNormal" -> "u";
  "arm" -> "num_links, _, link_masses, _";
  "arm" -> "μ";
  "covariance" -> "s";
  "dt" -> "μ";
  "environment" -> "g";
  "environment" -> "μ";
  "get_gravity" -> "g";
  "get_properties" -> "num_links, _, link_masses, _";
  "goal" -> "s";
  "gravity_compensation" -> "u";
  "i" -> "μ";
  "initial_state" -> "s";
  "mean" -> "s";
  "s" -> "μ";
  "state_transition_3d" -> "μ";
  "u" -> "μ";
  "zeros" -> "gravity_compensation";
  "Σ" -> "u";
  "μ" -> "u";
}
